Config/InformationRegisters/emoji.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>emoji</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>emString</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>urlString</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Name</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/emoji/Ext/ManagerModule.bsl
#Region Public

// --------------------------------------------------------------------------------
Procedure ExchangePlansRecordChanges(pData, pReceiverNode = Undefined) Export
	// NOTHING SO FAR	
EndProcedure // ExchangePlansRecordChanges

//Initialise emoji from attached template
Procedure pmInit() Export
	vTextList = InformationRegisters.emoji.GetTemplate("List");
	i = 0;
	While i < vTextList.LineCount() Do
		i = i + 1;
		curLine = vTextList.GetLine(i);
		pos = StrFind(curLine,";");
		If pos = 0 Then
			Continue;
		EndIf;
		
		name = Mid(curLine,pos+1);
		code = Left(curLine,pos-1);
		
		tm = InformationRegisters.emoji.CreateRecordManager();
		
		tm.Name  = name;
		tm.urlString = StrReplace(code,"\x","%");
		tm.emString = DecodeString(tm.urlString,StringEncodingMethod.URLEncoding);
		tm.Write();		
	EndDO;
EndProcedure

#EndRegion
